{
  "name": "Basic Spell Books",
  "icon": "irons_spellbooks:iron_spell_book",
  "category": "irons_spellbooks:root",
  "sortnum": 1,
  "read_by_default" : true,
  "pages": [
    {
      "type": "patchouli:text",
      "title": "Craftable Spell Books",
      "text": "Many spell Books can be crafted from a combination of vanilla and arcane materials. Each further tier crafted increases the slot count of the spell book and often comes with extra bonuses, increasing the power and quantity of spells it can contain."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "irons_spellbooks:copper_spell_book",
      "recipe2": "irons_spellbooks:iron_spell_book"
    },
    {
      "type": "patchouli:crafting",
      "recipe": "irons_spellbooks:gold_spell_book",
      "recipe2": "irons_spellbooks:diamond_spell_book"
    },
    {
      "type": "patchouli:crafting",
      "recipe": "irons_spellbooks:netherite_spell_book",
      "recipe2": "irons_spellbooks:dragonskin_spell_book"
    },
    {
      "type": "patchouli:text",
      "title": "Named Spell Books",
      "text": "Named spell books can be found nestled in many corners of the world, often offering bonuses to lucky adventurers looking in the right places."
    },
    {
      "type": "patchouli:spotlight",
      "item": "irons_spellbooks:rotten_spell_book",
      "text": "What may have once been a more powerful book has since rotted away, leaving but three pages. Yet, still more powerful than most Overworld spell books. They can be looted from equally rotten places all across the Overworld."
    },
    {
      "type": "patchouli:spotlight",
      "item": "irons_spellbooks:villager_spell_book",
      "text": "A regular book with a little blessing makes a suitable channel for divine magic. Building a reputation with the villagers, especially by freeing captives from the Archevoker, will ensure one falls into your hands eventually."
    },
    {
      "type": "patchouli:spotlight",
      "item": "irons_spellbooks:blaze_spell_book",
      "text": "Every Blaze, unbeknownst to them, comes with one of these tucked away. The trick is killing them and hoping it doesn't turn into ash."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "irons_spellbooks:druidic_spell_book",
      "text": "A strong magical energy still persists within the Rotten Spell Book. The book may be blessed anew if a proper remedy were applied."
    }
  ]
}